# SetHLLineStyle

## Description
Sets the Line Style of the specified Hidden Line Rendering options handle.

```pascal
PROCEDURE SetHLLineStyle(
				HLOptionsHandle : HANDLE;
				lineStyle       : INTEGER);
```

```python
def vs.SetHLLineStyle(HLOptionsHandle, lineStyle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|HLOptionsHandle|HANDLE|   |
|lineStyle|INTEGER|   |

## Version
Availability: from Vectorworks 2019

## Category
* View @ Zoom